Revit 2023 API
RebarInSystem.GetReinforcementRoundingManager Method
 Returns an object for managing reinforcement rounding override settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public RebarRoundingManager GetReinforcementRoundingManager()
Visual Basic
Public Function GetReinforcementRoundingManager As RebarRoundingManager
Visual C++
public:
RebarRoundingManager^ GetReinforcementRoundingManager()
Return Value
 The rounding manager.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace